"""Снабди каждый комментарий правильной командой."""

python -V  # команда для проверки текущей версии Питона
python # запуск интерпретатора Питона в режиме REPL
py -m venv my_env # создание виртуального окружения в текущей директории
.\my_env\Scripts\Activate.ps1 # активация вышесозданного виртуального окружения в Windows для запуска из powershell
 deactivate # деактивация виртуального окружения
 python run.py # запуск скрипта run.py находящегося в текущей директории
 pip install requests # установка пакета requests через пакетный менеджер pip
